#include<stdio.h>
int A=0,B=0;
int C=0,D=0;
int E=0;
int F=0;
int coun=0;

main(){

 printf("Δώσε τον πρώτο από τους δυο αριθμούς που θέλεις να πολλαπλασιάσεις ");
 scanf("%d",&A);
 printf("Δώσε τον δεύτερο από τους δυο αριθμούς που θέλεις να πολλαπλασιάσεις ");
 scanf("%d",&B);

F=A*B;
 
if (A>=B){
  C=A;D=B;}
if (B>A){
  C=B;D=A;}


for (coun=D-1; coun >=0; coun--){
 E=E+C+coun;
C=C-1;
}

printf("Η πράξη πολλαπλασιασμού   %d επί  %d που δώσατε και έχει αποτέλεσμα  %d \n", A,B,F);
printf("Με τον τρόπο τον πεπερασμένων προσθέσεων βγάζει αποτέλεσμα  %d \n " ,E);


}

